MCUdude/MightyCore/avr/boards.txt
# Brown out detection - This is the first part of the low fuse bit concatenation
32.menu.BOD.2v7=BOD 2.7V
32.menu.BOD.2v7.bootloader.bod_bits=10
32.menu.BOD.4v0=BOD 4.0V
32.menu.BOD.4v0.bootloader.bod_bits=00
32.menu.BOD.disabled=BOD disabled
32.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
32.menu.LTO.Os=LTO disabled
32.menu.LTO.Os.compiler.c.extra_flags=
32.menu.LTO.Os.compiler.c.elf.extra_flags=
32.menu.LTO.Os.compiler.cpp.extra_flags=
32.menu.LTO.Os.ltoarcmd=avr-ar

32.menu.LTO.Os_flto=LTO enabled
32.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
32.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
32.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
32.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
32.menu.clock.16MHz_external=16 MHz external
32.menu.clock.16MHz_external.upload.speed=115200
32.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.16MHz_external.bootloader.ckopt_bit=0
32.menu.clock.16MHz_external.build.f_cpu=16000000L

32.menu.clock.20MHz_external=20 MHz external
32.menu.clock.20MHz_external.upload.speed=115200
32.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.20MHz_external.bootloader.ckopt_bit=0
32.menu.clock.20MHz_external.build.f_cpu=20000000L

32.menu.clock.18_432MHz_external=18.432 MHz external
32.menu.clock.18_432MHz_external.upload.speed=115200
32.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
32.menu.clock.18_432MHz_external.build.f_cpu=18432000L

32.menu.clock.12MHz_external=12 MHz external
32.menu.clock.12MHz_external.upload.speed=57600
32.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.12MHz_external.bootloader.ckopt_bit=0
32.menu.clock.12MHz_external.build.f_cpu=12000000L

32.menu.clock.8MHz_external=8 MHz external
32.menu.clock.8MHz_external.upload.speed=57600
32.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
32.menu.clock.8MHz_external.bootloader.ckopt_bit=0
32.menu.clock.8MHz_external.build.f_cpu=8000000L

32.menu.clock.8MHz_internal=8 MHz internal
32.menu.clock.8MHz_internal.upload.speed=38400
32.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
32.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.8MHz_internal.build.f_cpu=8000000L

32.menu.clock.1MHz_internal=1 MHz internal
32.menu.clock.1MHz_internal.upload.speed=9600
32.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
32.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
32.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega16/A  ####
#####################

# General
16.name=ATmega16
16.upload.tool=avrdude
16.upload.maximum_data_size=1024
16.bootloader.tool=avrdude
16.bootloader.unlock_bits=0x3f
16.bootloader.lock_bits=0x0f
16.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
16.bootloader.high_fuses=0b110{bootloader.ckopt_bit}010{bootloader.bootrst_bit}
16.build.core=MCUdude_corefiles
16.build.board=AVR_ATmega16
16.build.mcu=atmega16

# Upload port select
16.menu.bootloader.uart0=Yes (UART0)
16.menu.bootloader.uart0.upload.maximum_size=15872
16.menu.bootloader.uart0.upload.protocol=arduino
16.menu.bootloader.uart0.upload.port=UART0
16.menu.bootloader.uart0.bootloader.bootrst_bit=0
16.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

16.menu.bootloader.no_bootloader=No bootloader
16.menu.bootloader.no_bootloader.upload.maximum_size=16384
16.menu.bootloader.no_bootloader.bootloader.bootrst_bit=1
16.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Pinouts
16.menu.pinout.standard=Standard pinout
16.menu.pinout.standard.build.variant=standard
16.menu.pinout.bobuino=Bobuino pinout
16.menu.pinout.bobuino.build.variant=bobuino
16.menu.pinout.sanguino=Sanguino pinout
16.menu.pinout.sanguino.build.variant=sanguino

# Brown out detection - This is the first part of the low fuse bit concatenation
16.menu.BOD.2v7=BOD 2.7V
16.menu.BOD.2v7.bootloader.bod_bits=10
16.menu.BOD.4v0=BOD 4.0V
16.menu.BOD.4v0.bootloader.bod_bits=00
16.menu.BOD.disabled=BOD disabled
16.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
16.menu.LTO.Os=LTO disabled
16.menu.LTO.Os.compiler.c.extra_flags=
16.menu.LTO.Os.compiler.c.elf.extra_flags=
16.menu.LTO.Os.compiler.cpp.extra_flags=
16.menu.LTO.Os.ltoarcmd=avr-ar

16.menu.LTO.Os_flto=LTO enabled
16.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
16.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
16.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
16.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
16.menu.clock.16MHz_external=16 MHz external
16.menu.clock.16MHz_external.upload.speed=115200
16.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.16MHz_external.bootloader.ckopt_bit=0
16.menu.clock.16MHz_external.build.f_cpu=16000000L

16.menu.clock.20MHz_external=20 MHz external
16.menu.clock.20MHz_external.upload.speed=115200
16.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.20MHz_external.bootloader.ckopt_bit=0
16.menu.clock.20MHz_external.build.f_cpu=20000000L

16.menu.clock.18_432MHz_external=18.432 MHz external
16.menu.clock.18_432MHz_external.upload.speed=115200
16.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
16.menu.clock.18_432MHz_external.build.f_cpu=18432000L

16.menu.clock.12MHz_external=12 MHz external
16.menu.clock.12MHz_external.upload.speed=57600
16.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.12MHz_external.bootloader.ckopt_bit=0
16.menu.clock.12MHz_external.build.f_cpu=12000000L

16.menu.clock.8MHz_external=8 MHz external
16.menu.clock.8MHz_external.upload.speed=57600
16.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
16.menu.clock.8MHz_external.bootloader.ckopt_bit=0
16.menu.clock.8MHz_external.build.f_cpu=8000000L

16.menu.clock.8MHz_internal=8 MHz internal
16.menu.clock.8MHz_internal.upload.speed=38400
16.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
16.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
16.menu.clock.8MHz_internal.build.f_cpu=8000000L

16.menu.clock.1MHz_internal=1 MHz internal
16.menu.clock.1MHz_internal.upload.speed=9600
16.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
16.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
16.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega8535  ####
#####################

# General
8535.name=ATmega8535
8535.upload.tool=avrdude
8535.upload.maximum_data_size=512
8535.bootloader.tool=avrdude
8535.bootloader.unlock_bits=0x3f
8535.bootloader.lock_bits=0x0f
8535.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
8535.bootloader.high_fuses=0b110{bootloader.ckopt_bit}010{bootloader.bootrst_bit}
8535.build.core=MCUdude_corefiles
8535.build.board=AVR_ATmega8535
8535.build.mcu=atmega8535

# Upload port select
8535.menu.bootloader.uart0=Yes (UART0)
8535.menu.bootloader.uart0.upload.maximum_size=7680
8535.menu.bootloader.uart0.upload.protocol=arduino
8535.menu.bootloader.uart0.upload.port=UART0
8535.menu.bootloader.uart0.bootloader.bootrst_bit=0
8535.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

8535.menu.bootloader.no_bootloader=No bootloader
8535.menu.bootloader.no_bootloader.upload.maximum_size=8192
8535.menu.bootloader.no_bootloader.bootloader.bootrst_bit=1
8535.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Pinouts
8535.menu.pinout.standard=Standard pinout
8535.menu.pinout.standard.build.variant=standard
8535.menu.pinout.bobuino=Bobuino pinout
8535.menu.pinout.bobuino.build.variant=bobuino
8535.menu.pinout.sanguino=Sanguino pinout
8535.menu.pinout.sanguino.build.variant=sanguino

