MCUdude/MightyCore/avr/boards.txt
# Brown out detection - This is the first part of the low fuse bit concatenation
8535.menu.BOD.2v7=BOD 2.7V
8535.menu.BOD.2v7.bootloader.bod_bits=10
8535.menu.BOD.4v0=BOD 4.0V
8535.menu.BOD.4v0.bootloader.bod_bits=00
8535.menu.BOD.disabled=BOD disabled
8535.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
8535.menu.LTO.Os=LTO disabled
8535.menu.LTO.Os.compiler.c.extra_flags=
8535.menu.LTO.Os.compiler.c.elf.extra_flags=
8535.menu.LTO.Os.compiler.cpp.extra_flags=
8535.menu.LTO.Os.ltoarcmd=avr-ar

8535.menu.LTO.Os_flto=LTO enabled
8535.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
8535.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
8535.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
8535.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
8535.menu.clock.16MHz_external=16 MHz external
8535.menu.clock.16MHz_external.upload.speed=115200
8535.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.16MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.16MHz_external.build.f_cpu=16000000L

8535.menu.clock.20MHz_external=20 MHz external
8535.menu.clock.20MHz_external.upload.speed=115200
8535.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.20MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.20MHz_external.build.f_cpu=20000000L

8535.menu.clock.18_432MHz_external=18.432 MHz external
8535.menu.clock.18_432MHz_external.upload.speed=115200
8535.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.18_432MHz_external.build.f_cpu=18432000L

8535.menu.clock.12MHz_external=12 MHz external
8535.menu.clock.12MHz_external.upload.speed=57600
8535.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.12MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.12MHz_external.build.f_cpu=12000000L

8535.menu.clock.8MHz_external=8 MHz external
8535.menu.clock.8MHz_external.upload.speed=57600
8535.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
8535.menu.clock.8MHz_external.bootloader.ckopt_bit=0
8535.menu.clock.8MHz_external.build.f_cpu=8000000L

8535.menu.clock.8MHz_internal=8 MHz internal
8535.menu.clock.8MHz_internal.upload.speed=38400
8535.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
8535.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
8535.menu.clock.8MHz_internal.build.f_cpu=8000000L

8535.menu.clock.1MHz_internal=1 MHz internal
8535.menu.clock.1MHz_internal.upload.speed=9600
8535.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
8535.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
8535.menu.clock.1MHz_internal.build.f_cpu=1000000L
